// src/middleware/notFoundHandler.js
// -------------------------------------------
// 404 middleware
//
//  обробку випадку, коли клієнт звертається до неіснуючого маршруту.
// Це middleware підключається після всіх маршрутів.
// Якщо жоден маршрут не збігся, керування потрапить сюди.
// Ми відправляємо клієнту відповідь зі статусом 404 Not Found.
// далі потрібно імпортувати та запустити на сервері // src/server.js
// -------------------------------------------

export const notFoundHandler = (req, res) => {
  res.status(404).json({ message: 'Route not found' });
};
