// src/routes/studentsRoutes.js
// ------------------------------------
// Роутер для студентів

import { Router } from 'express';
import {
  getStudents,
  getStudentById,
} from '../controllers/studentsController.js';

const router = Router();

router.get('/students', getStudents);
router.get('/students/:studentId', getStudentById);

export default router;

// ===============================================
// Роутер для студентів
// src/routes/studentsRoutes.js
// ===============================================
// Тут оголошуємо роутер і одразу експортуємо його. Це «порожня рамка», у яку додамо маршрути.
// Далі переносимо контролери, які обробляють маршрути /students та /students/:studentId із файла server.js у файл роутингу studentsRoutes.js. Для їх оголошення замість app використовуємо створений router
// ------------------------------------
// Підключаємо роутер
// Тепер імпортуємо створений роутер у файл server.js та додаємо його як middleware до app, за допомогою методу app.use().
// ------------------------------------
// Створюємо контролери
// Створіть папку src/controllers, а в ній файл studentsController.js. У цей файл винесемо контролери, які зараз знаходяться у файлі studentsRoutes.js
// -----------------------------------------------
// Використовуємо контролери у роутері
// Тепер оновимо файл src/routes/studentsRoutes.js, щоб замість логіки напряму викликати контролери.
// -----------------------------------------------
// Ми винесли контролери в окремий файл і тепер маршрути виглядають більш чисто. Така організація дозволяє:
// відокремити логіку обробки запитів від опису маршрутів;
// полегшити підтримку та рефакторинг коду;
// підготувати ґрунт для подальшої роботи (наприклад, додавання нових методів чи валідації).
// -----------------------------------------------
