// src/routes/studentsRoutes.js
// ------------------------------------
// Роутер для студентів

import { Router } from 'express';
import {
  getStudents,
  getStudentById,
  createStudent,
  deleteStudent,
  updateStudent,
} from '../controllers/studentsController.js';

const router = Router();

router.get('/students', getStudents);
router.get('/students/:studentId', getStudentById);
router.post('/students', createStudent);
router.delete('/students/:studentId', deleteStudent);
router.patch('/students/:studentId', updateStudent);

export default router;

// ===============================================
// Роутер для студентів
// src/routes/studentsRoutes.js
// ===============================================
// Тут оголошуємо роутер і одразу експортуємо його. Це «порожня рамка», у яку додамо маршрути.
// Далі переносимо контролери, які обробляють маршрути /students та /students/:studentId із файла server.js у файл роутингу studentsRoutes.js. Для їх оголошення замість app використовуємо створений router
// ------------------------------------
// Підключаємо роутер
// Тепер імпортуємо створений роутер у файл server.js та додаємо його як middleware до app, за допомогою методу app.use().
// ------------------------------------
// Створюємо контролери
// Створіть папку src/controllers, а в ній файл studentsController.js. У цей файл винесемо контролери, які зараз знаходяться у файлі studentsRoutes.js
// -----------------------------------------------
// Використовуємо контролери у роутері
// Тепер оновимо файл src/routes/studentsRoutes.js, щоб замість логіки напряму викликати контролери.
// -----------------------------------------------
// Ми винесли контролери в окремий файл і тепер маршрути виглядають більш чисто. Така організація дозволяє:
// відокремити логіку обробки запитів від опису маршрутів;
// полегшити підтримку та рефакторинг коду;
// підготувати ґрунт для подальшої роботи (наприклад, додавання нових методів чи валідації).

// ===============================================
// Роут POST запиту
// ===============================================
// Додаємо можливість створювати нового студента до колекції за маршрутом POST /students. У запиті будемо очікувати тіло запиту, яке приходитиме як JSON.
// -----------------------------------------------
// Контролер
//
// Дописуємо контролер у файл src/controllers/studentsController.js. Він читає дані з req.body і створює документ через Student.create(...). Для запитів, які щось створюють, семантично правильно відправляти відповідь зі статус-кодом 201 Created.
// src/controllers/studentsController.js
// -------------------------------
// Роут
//
// ДАЛІ ми підключаємо контролер у маршрутизатор студентів у файлі:
// src/routes/studentsRoutes.js
// -------------------------------
// ===============================================
// Роут DELETE запиту
// ===============================================
// Додаємо маршрут DELETE /students/:studentId, за допомогою якого користувачі зможуть видаляти студентів з бази даних.
// -------------------------------
// Контролер
// -------------------------------
// Для видалення документа з колекції в Mongoose використовується метод:
// findOneAndDelete(filter, options)
// де:
// filter — перший аргумент, який вказує на умову пошуку документа для видалення (обов’язковий);
// options — об’єкт із додатковими налаштуваннями (необов’язковий);
// У контролері отримуємо studentId із параметрів, видаляємо студента через Mongoose-метод findOneAndDelete, і якщо такого не існує — повертаємо помилку 404. Якщо все добре — повертаємо 200 Success.
// -------------------------------
// Роут
// -------------------------------
// Додаємо DELETE-роут /students/:studentId та підключаємо контролер
//
// ===============================================
// Роут PATCH запиту
// ===============================================
// Додаємо маршрут PATCH /students/:studentId, за допомогою якого користувачі зможуть частково оновлювати дані студентів у базі даних. Від PUT метод PATCH відрізняється тим, що оновлюється не весь ресурс, а лише окремі його поля
// -------------------------------
// Метод Mongoose
// -------------------------------
// Для оновлення документа в Mongoose використовується метод:
// findOneAndUpdate(query, update, options)
// де:
// query — об’єкт умов пошуку документа (обов’язковий);
// update — об’єкт із даними для оновлення (обов’язковий);
// options — об’єкт додаткових налаштувань (необов’язковий), наприклад:
// returnDocument: "after" — повернути оновлений документ;
// includeResultMetadata: true — додати метадані результату;
// upsert: true — створити документ, якщо не знайдено (для PATCH зазвичай не використовуємо).
// -------------------------------
// Контролер
// -------------------------------
// У контролері беремо studentId з параметрів, req.body — дані для часткового оновлення. Якщо студента не знайдено — повертаємо 404. Якщо все добре — повертаємо 200 і оновлений документ.
// src/controllers/studentsController.js
// -------------------------------
// Роут
// -------------------------------
// Підключаємо контролер у маршрутизатор студентів:
// src/routes/studentsRoutes.js
