// src/validations/authValidation.js
// =========================================
// Схема валідації (4.2 - Реєстрація користувачів)

import { Joi, Segments } from 'celebrate';

// Схема валідації auth/register
export const registerUserSchema = {
  [Segments.BODY]: Joi.object({
    email: Joi.string().email().required(),
    password: Joi.string().min(8).required(),
  }),
};

// Схема валідації (Логін користувачів), (4.7)
export const loginUserSchema = {
  [Segments.BODY]: Joi.object({
    email: Joi.string().email().required(),
    password: Joi.string().required(),
  }),
};

// (5.1) - Скидання паролю (Валідація тіла запиту),
// Перевіряємо, що в тілі є коректний email
// Реалізуємо ендпоінт POST /auth/request-reset-email
export const requestResetEmailSchema = {
  [Segments.BODY]: Joi.object({
    email: Joi.string().email().required(),
  }),
};

// (5.7.1) Валідація тіла запиту / Зміна паролю
// -----------------------------
export const resetPasswordSchema = {
  [Segments.BODY]: Joi.object({
    password: Joi.string().min(8).required(),
    token: Joi.string().required(),
  }),
};

// ======================= (5.7.1) =====================
// (5.7) Зміна паролю
// -----------------------------
// Тепер додамо частину функціоналу, що дозволяє встановити новий пароль за токеном із листа. Маршрут — POST /auth/reset-password.
//
// (5.7.1) Валідація тіла запиту / Зміна паролю
// -----------------------------
// src/validations/authValidation.js
//
// Ми очікуємо два поля: сам токен і новий пароль. Схема мінімальна — перевіряємо наявність і базовий формат
// token — підписаний JWT, який ми надіслали в листі (дійсний упродовж 15 хв).
// password — новий пароль, який користувач хоче встановити.
//
// -----------------------------
// (5.7.2) Контролер / Зміна паролю
// -----------------------------
// src/controllers/authController.js
//
// Контролер виконує чотири ключові кроки: перевіряє токен, знаходить користувача, хешує новий пароль і оновлює запис.
//

// ======================= (4.2) =====================
// Схема валідації auth
// Реєстрація відбувається через POST /auth/register. Дані приходять у тілі запиту, тому створимо схему для валідації.
// email — повинен бути валідним email і обов’язковим;
// password — мінімум 8 символів.

// ======================= (4.7) =====================
// (4.7) Логін користувачів / Схема валідації
// Спочатку описуємо валідацію тіла запиту: потрібні валідний email і пароль.
