// src/models/student.js
// --------------------------------
// Mongoose /  MongoDB
// (4.22) Зв’язок між моделями / Додаємо зв’язок у модель студента

import { Schema, model } from 'mongoose';

// Схема студента
// ----------------------------------
const studentSchema = new Schema(
  {
    name: {
      type: String,
      required: true,
      trim: true, // прибирає пробіли на початку та в кінці
    },
    age: {
      type: Number,
      required: true,
    },
    gender: {
      type: String,
      required: true,
      enum: ['male', 'female', 'other'],
    },
    avgMark: {
      type: Number,
      required: true,
    },
    onDuty: {
      type: Boolean,
      default: false,
    },
    // Нова властивість, (4.22) Зв'язок між моделями
    userId: {
      type: Schema.Types.ObjectId,
      ref: 'User',
      required: true,
    },
  },
  {
    timestamps: true,
    versionKey: false,
  },
);

// Значення 1 означає сортування за зростанням, але для індексу напрямок не має особливого значення.
// (4.22) Оновлюємо індекс полем userId, тому що будемо використовувати його при пошуку
studentSchema.index({ userId: 1, gender: 1, avgMark: 1 });

// Модель студента
// ----------------------------------
export const Student = model('Student', studentSchema);

//
//
// ============================================
// (4.22) Зв'язок між моделями / Додаємо зв'язок у модель студента
// ----------------------------------
// Ми розширимо схему студента, додавши поле userId. Це дозволить зрозуміти, кому саме належить конкретний студент

// Основна ідея авторизації полягає у тому, щоб обмежувати доступ до ресурсів на основі певних умов. У нашому випадку ми можемо уявити сценарій: користувачі — це викладачі, а студенти — це школярі, з якими вони працюють.
// Щоб кожен викладач бачив тільки своїх студентів, нам потрібно встановити зв'язок між моделями users та students.
// ---------------------------------
// Що таке ref?
// ---------------------------------
// ref: "User" означає, що поле userId посилається на інший документ у колекції users.
// Таким чином ми встановлюємо зв’язок між колекціями: кожен студент належить певному користувачу.
// Це дозволяє виконувати запити з використанням методу populate (наприклад, отримати студента разом з інформацією про користувача, якому він належить).

//
// ============================================
// Mongoose /  MongoDB
// ----------------------------------
// 1) Схема студента
// Схема (Schema): описує структуру документа (які поля і з якими типами будуть).
// Створимо схему для документа студента. Для цього використаємо клас Schema з бібліотеки mongoose.
// ----------------------------------
// Пояснення (Схема студента)
// ----------------------------------
// type — тип даних (String, Number, Boolean).
// required — чи поле обов’язкове.
// trim: true — автоматично видаляє зайві пробіли на початку та в кінці рядка. Корисно для текстових полів, таких як name, щоб уникнути збереження значень на кшталт " John ".
// enum — перелік допустимих значень (наприклад, для gender).
// default — значення за замовчуванням, якщо поле не передано.
// timestamps — автоматично додає createdAt і updatedAt.
// versionKey: false — вимикає службове поле __v.
// ----------------------------------
// 2) Модель студента
// Модель (Model): клас, створений на основі схеми. Використовується для роботи з колекцією.
// Створимо модель Student на основі нашої схеми:
// ----------------------------------
// Mongoose автоматично створить колекцію students у базі даних (назва береться у множині). Тепер ми можемо використовувати модель Student для взаємодії з колекцією: створювати нових студентів, отримувати список, оновлювати чи видаляти записи.
// ----------------------------------
// Взаємодія з базою даних
// src/server.js
// ----------------------------------
// Тепер, коли ми вже маємо базу students та модель Student, додамо маршрути для взаємодії з нею. Почнемо з отримання всіх студентів та отримання одного студента за його id
