// src/server.js
// ------------------------------------------------------
// npm init -y === Ініціалізує npm: файл package.json.
// npm install -D nodemon === автоматично перезапускає застосунок.
// npm init @eslint/config@latest === задати єдиний стиль написання коду
// npm install express ===  мінімалістичний веб-фреймворк для Node.js
// npm install cors === дозволяє браузеру робити запити з одного домену до іншого
// npm install pino-http pino-pretty ===  Логування запитів (вхідні/вихідні запити, час обробки)
// npm install dotenv ===  зчитування змінних оточення
// npm install mongoose === бібліотека Mongoose, підключення до MongoDB (БД)
// npm install http-errors === пакет http-errors дозволяє створювати помилки з потрібним статусом і повідомленням.

import express from 'express';
import 'dotenv/config';
import cors from 'cors';

import { connectMongoDB } from './db/connectMongoDB.js';
import { logger } from './middleware/logger.js';
import { notFoundHandler } from './middleware/notFoundHandler.js';
import { errorHandler } from './middleware/errorHandler.js';

import studentsRoutes from './routes/studentsRoutes.js';

const app = express();
const PORT = process.env.PORT ?? 3030; // Використовуємо значення з .env або дефолтний порт для сервера 3030

// Middleware list
// ===============================================

// Глобальні middleware
app.use(logger); // 1. Middleware, Логер pino, першим — бачить усі запити
app.use(express.json()); // 2. Middleware для парсингу JSON
app.use(cors()); // 3. Middleware, дозвіл для запитів з інших доменів

// Логування часу
app.use((req, res, next) => {
  console.log(`Time: ${new Date().toLocaleString()}`);
  next();
});

// МАРШРУТИ
// ===============================================
// підключаємо групу маршрутів студента
app.use(studentsRoutes);

// Middleware 404 — якщо маршрут не знайдено (після всіх маршрутів)
// -----------------------------------------------
app.use(notFoundHandler);

// Middleware 500 (Error) — якщо під час запиту виникла помилка (останнє)
// -----------------------------------------------
app.use(errorHandler);

// Підключення до MongoDB
// ===============================================
await connectMongoDB();

// Запуск сервера
// ===============================================
app.listen(PORT, () => {
  console.log(`Server is running on port ${PORT}`);
});

// ==========================================
// Взаємодія з базою даних "cloud.mongodb"
// src/server.js
// ==========================================
// Ми спочатку налаштували базу даних та підключення до неї
// src/db/connectMongoDB.js
// ------------------------------------
// оновили підключення для БД напряму, саме до бази даних "студентів" через env файл
// .env
// ------------------------------------
// Тепер, коли ми вже маємо базу students та модель Student, додамо маршрути для взаємодії з нею.
// src/models/student.js
// ------------------------------------
// Маршрут: отримати всіх студентів
// ------------------------------------
// У цьому маршруті ми будемо звертатися до колекції students через вбудований метод Mongoose Student.find(), який повертає масив документів (може бути порожнім), що відповідають моделі Student
// ------------------------------------
// Маршрут: отримати одного студента за id
// ------------------------------------
// Для цього маршруту ми використаємо вбудований метод Mongoose Student.findById(). Якщо документ із заданим ідентифікатором не буде знайдено, метод поверне null. У такому випадку ми повернемо статус 404.
//------------------------------------
// Тепер ми маємо:
// ------------------------------------
// GET http://localhost:3000/students → повертає всіх студентів.
// GET http://localhost:3000/students/:studentId → повертає одного студента або 404, якщо такого немає.

// Далі виносимо логіку мидвар у нові файли структури і імпортуємо у даному файлі код
// ==========================================
// Структура проєкту (РЕФАКТОРИНГ)
// ==========================================
// Створюємо в папці src нову папку middleware і кладемо туди наші кастомні middleware.
// -------------------------------------
// src/
//   middleware/
//     errorHandler.js
//     notFoundHandler.js
//     logger.js
//   server.js
// -------------------------------------
// Чому порядок важливий?
// -------------------------------------
// Logger першим → логуються всі вхідні запити.
// JSON і CORS далі → кожен запит обробляється перед передачею в маршрути.
// Маршрути → відповідають на конкретні запити.
// 404 handler → якщо маршрут не знайдено.
// Error handler → якщо трапилась помилка на будь-якому етапі.
//
// ===============================================================
// Організація роутингу
// ===============================================================
// До цього ми писали обробники запитів безпосередньо у файлі server.js. Якщо маршрутів стає більше, зручніше винести їх у окремі файли й групувати за доменами (наприклад, students, auth, courses). Для цього є Express Router — об'єкт, який дозволяє групувати маршрути та їх обробники у логічні блоки.
// -------------------------------------------------------------
// Створюємо роутер для студентів
// src/routes/studentsRoutes.js
// ------------------------------------
// Створіть файл src/routes/studentsRoutes.js. Тут оголошуємо роутер і одразу експортуємо його. Це «порожня рамка», у яку додамо маршрути.
// -------------------------------------------------------------
// Переносимо обробники у роутер
// src/routes/studentsRoutes.js
// ------------------------------------
// Далі переносимо контролери, які обробляють маршрути /students та /students/:studentId із файла server.js у файл роутингу studentsRoutes.js. Для їх оголошення замість app використовуємо створений router
// -------------------------------------------------------------
// Підключаємо роутер
// src/server.js
// ------------------------------------
// Тепер імпортуємо створений роутер у файл server.js та додаємо його як middleware до app, за допомогою методу app.use().
//
// -------------------------------------------------------------
// Підсумок
// -------------------------------------------------------------
// Така організація коду створює зрозумілу структуру проєкту:

// server.js відповідає за складання застосунку та запуск сервера;
// роутери містять логіку для роботи з конкретними сутностями (у нашому випадку — студентами);
// моделі визначають доступ до бази даних.
// Цей підхід робить код більш чистим, масштабованим і зручним у підтримці
// ===============================================================
// Організація контролерів
// ===============================================================
// Контролери — це функції, які відповідають за обробку запитів і формування відповіді. Роутер лише «знає», який контролер викликати для конкретного маршруту, а саму логіку ми зберігаємо в іншому місці. Це робить код більш організованим і зрозумілим.
// -------------------------------------------------------------
// Створюємо контролери
// src/controllers/studentsController.js
// -------------------------------------------------------------
// Створіть папку src/controllers, а в ній файл studentsController.js. У цей файл винесемо контролери, які зараз знаходяться у файлі studentsRoutes.js.

// ============ ПОПЕРЕДНІЙ КОД (ДО РОЗДІЛЕННЯ ЛОГІКИ) ============
// // src/server.js
// // ------------------------------------------------------
// // npm init -y === Ініціалізує npm: файл package.json.
// // npm install -D nodemon === автоматично перезапускає застосунок.
// // npm init @eslint/config@latest === задати єдиний стиль написання коду
// // npm install express ===  мінімалістичний веб-фреймворк для Node.js
// // npm install cors === дозволяє браузеру робити запити з одного домену до іншого
// // npm install pino-http pino-pretty ===  Логування запитів (вхідні/вихідні запити, час обробки)
// // npm install dotenv ===  зчитування змінних оточення
// // npm install mongoose === бібліотека Mongoose, підключення до MongoDB (БД)

// import express from 'express';
// import cors from 'cors';
// import pino from 'pino-http';
// import 'dotenv/config';

// import { connectMongoDB } from './db/connectMongoDB.js';
// import { Student } from './models/student.js';

// const app = express();
// const PORT = process.env.PORT ?? 3030; // Використовуємо значення з .env або дефолтний порт для сервера 3030

// // Middleware list
// // ===============================================

// app.use(express.json()); // Middleware для парсингу JSON
// app.use(cors()); // Дозволяє запити з будь-яких джерел
// app.use(
//   pino({
//     level: 'info',
//     transport: {
//       target: 'pino-pretty',
//       options: {
//         colorize: true,
//         translateTime: 'HH:MM:ss',
//         ignore: 'pid,hostname',
//         messageFormat:
//           '{req.method} {req.url} {res.statusCode} - {responseTime}ms',
//         hideObject: true,
//       },
//     },
//   }),
// ); // Логування запитів

// app.use((req, res, next) => {
//   console.log(`Time: ${new Date().toLocaleString()}`);
//   next();
// }); // Логування часу

// // Кореневий маршрут (прибираємо)
// // ===============================================
// // app.get('/', (req, res) => {
// //   res.status(200).json({ message: 'Hello, World!' });
// // });

// // Маршрут GET /students : отримати всіх студентів
// // ===============================================
// // У цьому маршруті ми будемо звертатися до колекції students через вбудований метод Mongoose Student.find(), який повертає масив документів (може бути порожнім), що відповідають моделі Student.

// app.get('/students', async (req, res) => {
//   const students = await Student.find();
//   res.status(200).json(students);
// });

// // Маршрут GET /students/:studentId: отримати одного студента за id
// // ===============================================
// // Для цього маршруту ми використаємо вбудований метод Mongoose Student.findById(). Якщо документ із заданим ідентифікатором не буде знайдено, метод поверне null. У такому випадку ми повернемо статус 404.
// // Властивість params на об’єкті запиту req містить динамічні параметри маршруту. Кожне ім’я параметра відповідає властивості цього об’єкта, а значення, передане в URL, стає значенням цієї властивості.

// app.get('/students/:studentId', async (req, res) => {
//   const { studentId } = req.params;
//   const student = await Student.findById(studentId);

//   if (!student) {
//     return res.status(404).json({ message: 'Student not found' });
//   }

//   res.status(200).json(student);
// });

// // Маршрут для тестування middleware помилки (прибираємо)
// // GET http://localhost:3000/test-error
// // GET {{domain}}/test-error
// // ===============================================
// // app.get('/test-error', (req, res) => {
// //   // Штучна помилка для прикладу
// //   throw new Error('Something went wrong');
// // });

// // Middleware 404 (після всіх маршрутів)
// // GET http://localhost:3000/random
// // GET {{domain}}/random
// // ===============================================
// app.use((req, res) => {
//   res.status(404).json({ message: 'Route not found' });
// });

// // Middleware 500 для обробки помилок (останнє)
// // ===============================================
// // Middleware 500 з врахуванням змінної ENV 'production'
// // та обмеження в продакшн відображення деталей помилки
// // -----------------------------------------
// app.use((err, req, res, next) => {
//   console.error(err);

//   const isProd = process.env.NODE_ENV === 'production';

//   res.status(500).json({
//     message: isProd
//       ? 'Something went wrong. Please try again later.'
//       : err.message,
//   });
// });

// // Підключення до MongoDB
// // ===============================================
// await connectMongoDB();

// // Запуск сервера
// // ===============================================
// app.listen(PORT, () => {
//   console.log(`Server is running on port ${PORT}`);
// });

// // ==========================================
// // Взаємодія з базою даних "cloud.mongodb"
// // src/server.js
// // ==========================================
// // Ми спочатку налаштували базу даних та підключення до неї
// // src/db/connectMongoDB.js
// // ------------------------------------
// // оновили підключення для БД напряму, саме до бази даних "студентів" через env файл
// // .env
// // ------------------------------------
// // Тепер, коли ми вже маємо базу students та модель Student, додамо маршрути для взаємодії з нею.
// // src/models/student.js
// // ------------------------------------
// // Маршрут: отримати всіх студентів
// // ------------------------------------
// // У цьому маршруті ми будемо звертатися до колекції students через вбудований метод Mongoose Student.find(), який повертає масив документів (може бути порожнім), що відповідають моделі Student
// // ------------------------------------
// // Маршрут: отримати одного студента за id
// // ------------------------------------
// // Для цього маршруту ми використаємо вбудований метод Mongoose Student.findById(). Якщо документ із заданим ідентифікатором не буде знайдено, метод поверне null. У такому випадку ми повернемо статус 404.
// //------------------------------------
// // Тепер ми маємо:
// // ------------------------------------
// // GET http://localhost:3000/students → повертає всіх студентів.
// // GET http://localhost:3000/students/:studentId → повертає одного студента або 404, якщо такого немає.
